Revit 2027 API
WallUtils.IsWallJoinAllowedAtEnd Method
 Identifies if the indicated end of the wall allows joins or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsWallJoinAllowedAtEnd(
	Wall wall,
	int end
)
Public Shared Function IsWallJoinAllowedAtEnd (
	wall As Wall,
	end As Integer
) As Boolean
public:
static bool IsWallJoinAllowedAtEnd(
	Wall^ wall,
	int end
)
static member IsWallJoinAllowedAtEnd :
        wall : Wall *
        end : int -> bool
Parameters
wall Wall
 The wall in question
end Int32
 0 or 1 for the beginning or end of the wall's curve
Return Value
Boolean
 true if it is allowed to join. false if it is disallowed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WallUtils Class
Autodesk.Revit.DB Namespace